virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/component/l2cc.h
/* -------- L2CC_ILKR : (L2CC Offset: 0x904) (R/W 32) Instruction Lockdown Register -------- */
#define L2CC_ILKR_ILK0_Pos                    _U_(0)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 0 Position */
#define L2CC_ILKR_ILK0_Msk                    (_U_(0x1) << L2CC_ILKR_ILK0_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 0 Mask */
#define L2CC_ILKR_ILK0(value)                 (L2CC_ILKR_ILK0_Msk & ((value) << L2CC_ILKR_ILK0_Pos))
#define L2CC_ILKR_ILK1_Pos                    _U_(1)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 1 Position */
#define L2CC_ILKR_ILK1_Msk                    (_U_(0x1) << L2CC_ILKR_ILK1_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 1 Mask */
#define L2CC_ILKR_ILK1(value)                 (L2CC_ILKR_ILK1_Msk & ((value) << L2CC_ILKR_ILK1_Pos))
#define L2CC_ILKR_ILK2_Pos                    _U_(2)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 2 Position */
#define L2CC_ILKR_ILK2_Msk                    (_U_(0x1) << L2CC_ILKR_ILK2_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 2 Mask */
#define L2CC_ILKR_ILK2(value)                 (L2CC_ILKR_ILK2_Msk & ((value) << L2CC_ILKR_ILK2_Pos))
#define L2CC_ILKR_ILK3_Pos                    _U_(3)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 3 Position */
#define L2CC_ILKR_ILK3_Msk                    (_U_(0x1) << L2CC_ILKR_ILK3_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 3 Mask */
#define L2CC_ILKR_ILK3(value)                 (L2CC_ILKR_ILK3_Msk & ((value) << L2CC_ILKR_ILK3_Pos))
#define L2CC_ILKR_ILK4_Pos                    _U_(4)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 4 Position */
#define L2CC_ILKR_ILK4_Msk                    (_U_(0x1) << L2CC_ILKR_ILK4_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 4 Mask */
#define L2CC_ILKR_ILK4(value)                 (L2CC_ILKR_ILK4_Msk & ((value) << L2CC_ILKR_ILK4_Pos))
#define L2CC_ILKR_ILK5_Pos                    _U_(5)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 5 Position */
#define L2CC_ILKR_ILK5_Msk                    (_U_(0x1) << L2CC_ILKR_ILK5_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 5 Mask */
#define L2CC_ILKR_ILK5(value)                 (L2CC_ILKR_ILK5_Msk & ((value) << L2CC_ILKR_ILK5_Pos))
#define L2CC_ILKR_ILK6_Pos                    _U_(6)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 6 Position */
#define L2CC_ILKR_ILK6_Msk                    (_U_(0x1) << L2CC_ILKR_ILK6_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 6 Mask */
#define L2CC_ILKR_ILK6(value)                 (L2CC_ILKR_ILK6_Msk & ((value) << L2CC_ILKR_ILK6_Pos))
#define L2CC_ILKR_ILK7_Pos                    _U_(7)                                               /**< (L2CC_ILKR) Instruction Lockdown in Way Number 7 Position */
#define L2CC_ILKR_ILK7_Msk                    (_U_(0x1) << L2CC_ILKR_ILK7_Pos)                     /**< (L2CC_ILKR) Instruction Lockdown in Way Number 7 Mask */
#define L2CC_ILKR_ILK7(value)                 (L2CC_ILKR_ILK7_Msk & ((value) << L2CC_ILKR_ILK7_Pos))
#define L2CC_ILKR_Msk                         _U_(0x000000FF)                                      /**< (L2CC_ILKR) Register Mask  */

#define L2CC_ILKR_ILK_Pos                     _U_(0)                                               /**< (L2CC_ILKR Position) Instruction Lockdown in Way Number 7 */
#define L2CC_ILKR_ILK_Msk                     (_U_(0xFF) << L2CC_ILKR_ILK_Pos)                     /**< (L2CC_ILKR Mask) ILK */
#define L2CC_ILKR_ILK(value)                  (L2CC_ILKR_ILK_Msk & ((value) << L2CC_ILKR_ILK_Pos)) 

/* -------- L2CC_DCR : (L2CC Offset: 0xF40) (R/W 32) Debug Control Register -------- */
#define L2CC_DCR_DCL_Pos                      _U_(0)                                               /**< (L2CC_DCR) Disable Cache Linefill Position */
#define L2CC_DCR_DCL_Msk                      (_U_(0x1) << L2CC_DCR_DCL_Pos)                       /**< (L2CC_DCR) Disable Cache Linefill Mask */
#define L2CC_DCR_DCL(value)                   (L2CC_DCR_DCL_Msk & ((value) << L2CC_DCR_DCL_Pos))  
#define L2CC_DCR_DWB_Pos                      _U_(1)                                               /**< (L2CC_DCR) Disable Write-back, Force Write-through Position */
#define L2CC_DCR_DWB_Msk                      (_U_(0x1) << L2CC_DCR_DWB_Pos)                       /**< (L2CC_DCR) Disable Write-back, Force Write-through Mask */
#define L2CC_DCR_DWB(value)                   (L2CC_DCR_DWB_Msk & ((value) << L2CC_DCR_DWB_Pos))  
#define L2CC_DCR_SPNIDEN_Pos                  _U_(2)                                               /**< (L2CC_DCR) SPNIDEN Value Position */
#define L2CC_DCR_SPNIDEN_Msk                  (_U_(0x1) << L2CC_DCR_SPNIDEN_Pos)                   /**< (L2CC_DCR) SPNIDEN Value Mask */
#define L2CC_DCR_SPNIDEN(value)               (L2CC_DCR_SPNIDEN_Msk & ((value) << L2CC_DCR_SPNIDEN_Pos))
#define L2CC_DCR_Msk                          _U_(0x00000007)                                      /**< (L2CC_DCR) Register Mask  */


/* -------- L2CC_PCR : (L2CC Offset: 0xF60) (R/W 32) Prefetch Control Register -------- */
#define L2CC_PCR_OFFSET_Pos                   _U_(0)                                               /**< (L2CC_PCR) Prefetch Offset Position */
#define L2CC_PCR_OFFSET_Msk                   (_U_(0x1F) << L2CC_PCR_OFFSET_Pos)                   /**< (L2CC_PCR) Prefetch Offset Mask */
#define L2CC_PCR_OFFSET(value)                (L2CC_PCR_OFFSET_Msk & ((value) << L2CC_PCR_OFFSET_Pos))
#define L2CC_PCR_NSIDEN_Pos                   _U_(21)                                              /**< (L2CC_PCR) Not Same ID on Exclusive Sequence Enable Position */
#define L2CC_PCR_NSIDEN_Msk                   (_U_(0x1) << L2CC_PCR_NSIDEN_Pos)                    /**< (L2CC_PCR) Not Same ID on Exclusive Sequence Enable Mask */
#define L2CC_PCR_NSIDEN(value)                (L2CC_PCR_NSIDEN_Msk & ((value) << L2CC_PCR_NSIDEN_Pos))
#define L2CC_PCR_IDLEN_Pos                    _U_(23)                                              /**< (L2CC_PCR) INCR Double Linefill Enable Position */
#define L2CC_PCR_IDLEN_Msk                    (_U_(0x1) << L2CC_PCR_IDLEN_Pos)                     /**< (L2CC_PCR) INCR Double Linefill Enable Mask */
#define L2CC_PCR_IDLEN(value)                 (L2CC_PCR_IDLEN_Msk & ((value) << L2CC_PCR_IDLEN_Pos))
#define L2CC_PCR_PDEN_Pos                     _U_(24)                                              /**< (L2CC_PCR) Prefetch Drop Enable Position */
#define L2CC_PCR_PDEN_Msk                     (_U_(0x1) << L2CC_PCR_PDEN_Pos)                      /**< (L2CC_PCR) Prefetch Drop Enable Mask */
#define L2CC_PCR_PDEN(value)                  (L2CC_PCR_PDEN_Msk & ((value) << L2CC_PCR_PDEN_Pos))
#define L2CC_PCR_DLFWRDIS_Pos                 _U_(27)                                              /**< (L2CC_PCR) Double Linefill on WRAP Read Disable Position */
#define L2CC_PCR_DLFWRDIS_Msk                 (_U_(0x1) << L2CC_PCR_DLFWRDIS_Pos)                  /**< (L2CC_PCR) Double Linefill on WRAP Read Disable Mask */
#define L2CC_PCR_DLFWRDIS(value)              (L2CC_PCR_DLFWRDIS_Msk & ((value) << L2CC_PCR_DLFWRDIS_Pos))
#define L2CC_PCR_DATPEN_Pos                   _U_(28)                                              /**< (L2CC_PCR) Data Prefetch Enable Position */
#define L2CC_PCR_DATPEN_Msk                   (_U_(0x1) << L2CC_PCR_DATPEN_Pos)                    /**< (L2CC_PCR) Data Prefetch Enable Mask */
#define L2CC_PCR_DATPEN(value)                (L2CC_PCR_DATPEN_Msk & ((value) << L2CC_PCR_DATPEN_Pos))
#define L2CC_PCR_INSPEN_Pos                   _U_(29)                                              /**< (L2CC_PCR) Instruction Prefetch Enable Position */
#define L2CC_PCR_INSPEN_Msk                   (_U_(0x1) << L2CC_PCR_INSPEN_Pos)                    /**< (L2CC_PCR) Instruction Prefetch Enable Mask */
#define L2CC_PCR_INSPEN(value)                (L2CC_PCR_INSPEN_Msk & ((value) << L2CC_PCR_INSPEN_Pos))
#define L2CC_PCR_DLEN_Pos                     _U_(30)                                              /**< (L2CC_PCR) Double Linefill Enable Position */
#define L2CC_PCR_DLEN_Msk                     (_U_(0x1) << L2CC_PCR_DLEN_Pos)                      /**< (L2CC_PCR) Double Linefill Enable Mask */
#define L2CC_PCR_DLEN(value)                  (L2CC_PCR_DLEN_Msk & ((value) << L2CC_PCR_DLEN_Pos))
#define L2CC_PCR_Msk                          _U_(0x79A0001F)                                      /**< (L2CC_PCR) Register Mask  */


/* -------- L2CC_POWCR : (L2CC Offset: 0xF80) (R/W 32) Power Control Register -------- */
#define L2CC_POWCR_STBYEN_Pos                 _U_(0)                                               /**< (L2CC_POWCR) Standby Mode Enable Position */
#define L2CC_POWCR_STBYEN_Msk                 (_U_(0x1) << L2CC_POWCR_STBYEN_Pos)                  /**< (L2CC_POWCR) Standby Mode Enable Mask */
#define L2CC_POWCR_STBYEN(value)              (L2CC_POWCR_STBYEN_Msk & ((value) << L2CC_POWCR_STBYEN_Pos))
#define L2CC_POWCR_DCKGATEN_Pos               _U_(1)                                               /**< (L2CC_POWCR) Dynamic Clock Gating Enable Position */
#define L2CC_POWCR_DCKGATEN_Msk               (_U_(0x1) << L2CC_POWCR_DCKGATEN_Pos)                /**< (L2CC_POWCR) Dynamic Clock Gating Enable Mask */
#define L2CC_POWCR_DCKGATEN(value)            (L2CC_POWCR_DCKGATEN_Msk & ((value) << L2CC_POWCR_DCKGATEN_Pos))
#define L2CC_POWCR_Msk                        _U_(0x00000003)                                      /**< (L2CC_POWCR) Register Mask  */


